perf/results/20260905-151029/download.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/download.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m30s max duration (incl. graceful stop):
              * download: 50 looping VUs for 1m0s (gracefulStop: 30s)


running (0m02.7s), 50/50 VUs, 43 complete and 0 interrupted iterations
download   [   4% ] 50 VUs  0m02.5s/1m0s

running (0m02.7s), 50/50 VUs, 43 complete and 0 interrupted iterations
download   [   4% ] 50 VUs  0m02.5s/1m0s

running (0m03.0s), 50/50 VUs, 48 complete and 0 interrupted iterations
download   [   5% ] 50 VUs  0m02.9s/1m0s

running (0m04.0s), 50/50 VUs, 71 complete and 0 interrupted iterations
download   [   6% ] 50 VUs  0m03.9s/1m0s

running (0m05.0s), 50/50 VUs, 110 complete and 0 interrupted iterations
download   [   8% ] 50 VUs  0m04.9s/1m0s

running (0m06.0s), 50/50 VUs, 148 complete and 0 interrupted iterations
download   [  10% ] 50 VUs  0m05.9s/1m0s

running (0m07.0s), 50/50 VUs, 167 complete and 0 interrupted iterations
download   [  11% ] 50 VUs  0m06.9s/1m0s

running (0m08.0s), 50/50 VUs, 190 complete and 0 interrupted iterations
download   [  13% ] 50 VUs  0m07.9s/1m0s

running (0m09.0s), 50/50 VUs, 230 complete and 0 interrupted iterations
download   [  15% ] 50 VUs  0m08.9s/1m0s

running (0m10.0s), 50/50 VUs, 259 complete and 0 interrupted iterations
download   [  16% ] 50 VUs  0m09.9s/1m0s

running (0m11.0s), 50/50 VUs, 293 complete and 0 interrupted iterations
download   [  18% ] 50 VUs  0m10.9s/1m0s

running (0m12.0s), 50/50 VUs, 339 complete and 0 interrupted iterations
download   [  20% ] 50 VUs  0m11.9s/1m0s

running (0m13.0s), 50/50 VUs, 363 complete and 0 interrupted iterations
download   [  21% ] 50 VUs  0m12.9s/1m0s

running (0m14.0s), 50/50 VUs, 386 complete and 0 interrupted iterations
download   [  23% ] 50 VUs  0m13.9s/1m0s

running (0m15.1s), 50/50 VUs, 412 complete and 0 interrupted iterations
download   [  25% ] 50 VUs  0m14.9s/1m0s

running (0m16.1s), 50/50 VUs, 437 complete and 0 interrupted iterations
download   [  27% ] 50 VUs  0m16.0s/1m0s

running (0m17.0s), 50/50 VUs, 465 complete and 0 interrupted iterations
download   [  28% ] 50 VUs  0m16.9s/1m0s

running (0m18.0s), 50/50 VUs, 502 complete and 0 interrupted iterations
download   [  30% ] 50 VUs  0m17.9s/1m0s

running (0m19.0s), 50/50 VUs, 533 complete and 0 interrupted iterations
download   [  31% ] 50 VUs  0m18.9s/1m0s

running (0m20.0s), 50/50 VUs, 553 complete and 0 interrupted iterations
download   [  33% ] 50 VUs  0m19.9s/1m0s

running (0m21.0s), 50/50 VUs, 576 complete and 0 interrupted iterations
download   [  35% ] 50 VUs  0m20.9s/1m0s

running (0m22.0s), 50/50 VUs, 600 complete and 0 interrupted iterations
download   [  36% ] 50 VUs  0m21.9s/1m0s

running (0m23.0s), 50/50 VUs, 634 complete and 0 interrupted iterations
download   [  38% ] 50 VUs  0m22.9s/1m0s

running (0m24.0s), 50/50 VUs, 664 complete and 0 interrupted iterations
download   [  40% ] 50 VUs  0m23.9s/1m0s

running (0m25.0s), 50/50 VUs, 684 complete and 0 interrupted iterations
download   [  41% ] 50 VUs  0m24.9s/1m0s

running (0m26.0s), 50/50 VUs, 710 complete and 0 interrupted iterations
download   [  43% ] 50 VUs  0m25.9s/1m0s

running (0m27.0s), 50/50 VUs, 731 complete and 0 interrupted iterations
download   [  45% ] 50 VUs  0m26.9s/1m0s

running (0m28.0s), 50/50 VUs, 776 complete and 0 interrupted iterations
download   [  46% ] 50 VUs  0m27.9s/1m0s

running (0m29.0s), 50/50 VUs, 805 complete and 0 interrupted iterations
download   [  48% ] 50 VUs  0m28.9s/1m0s

running (0m30.0s), 50/50 VUs, 829 complete and 0 interrupted iterations
download   [  50% ] 50 VUs  0m29.9s/1m0s

running (0m31.0s), 50/50 VUs, 874 complete and 0 interrupted iterations
download   [  51% ] 50 VUs  0m30.9s/1m0s

running (0m32.0s), 50/50 VUs, 895 complete and 0 interrupted iterations
download   [  53% ] 50 VUs  0m31.9s/1m0s

running (0m33.0s), 50/50 VUs, 906 complete and 0 interrupted iterations
download   [  55% ] 50 VUs  0m32.9s/1m0s

running (0m34.0s), 50/50 VUs, 953 complete and 0 interrupted iterations
download   [  56% ] 50 VUs  0m33.9s/1m0s

running (0m35.0s), 50/50 VUs, 971 complete and 0 interrupted iterations
download   [  58% ] 50 VUs  0m34.9s/1m0s

running (0m36.0s), 50/50 VUs, 986 complete and 0 interrupted iterations
download   [  60% ] 50 VUs  0m35.9s/1m0s

running (0m37.0s), 50/50 VUs, 1011 complete and 0 interrupted iterations
download   [  61% ] 50 VUs  0m36.9s/1m0s

running (0m38.1s), 50/50 VUs, 1048 complete and 0 interrupted iterations
download   [  63% ] 50 VUs  0m37.9s/1m0s

running (0m39.0s), 50/50 VUs, 1086 complete and 0 interrupted iterations
download   [  65% ] 50 VUs  0m38.9s/1m0s

running (0m40.0s), 50/50 VUs, 1113 complete and 0 interrupted iterations
download   [  66% ] 50 VUs  0m39.9s/1m0s

running (0m41.0s), 50/50 VUs, 1142 complete and 0 interrupted iterations
download   [  68% ] 50 VUs  0m40.9s/1m0s

running (0m42.0s), 50/50 VUs, 1174 complete and 0 interrupted iterations
download   [  70% ] 50 VUs  0m41.9s/1m0s

running (0m43.0s), 50/50 VUs, 1201 complete and 0 interrupted iterations
download   [  71% ] 50 VUs  0m42.9s/1m0s

running (0m44.0s), 50/50 VUs, 1221 complete and 0 interrupted iterations
download   [  73% ] 50 VUs  0m43.9s/1m0s

running (0m45.0s), 50/50 VUs, 1241 complete and 0 interrupted iterations
download   [  75% ] 50 VUs  0m44.9s/1m0s

running (0m46.0s), 50/50 VUs, 1282 complete and 0 interrupted iterations
download   [  76% ] 50 VUs  0m45.8s/1m0s

running (0m47.0s), 50/50 VUs, 1310 complete and 0 interrupted iterations
download   [  78% ] 50 VUs  0m46.9s/1m0s

running (0m48.0s), 50/50 VUs, 1337 complete and 0 interrupted iterations
download   [  80% ] 50 VUs  0m47.9s/1m0s

running (0m49.0s), 50/50 VUs, 1384 complete and 0 interrupted iterations
download   [  81% ] 50 VUs  0m48.9s/1m0s

running (0m50.0s), 50/50 VUs, 1405 complete and 0 interrupted iterations
download   [  83% ] 50 VUs  0m49.9s/1m0s

running (0m51.0s), 50/50 VUs, 1428 complete and 0 interrupted iterations
download   [  85% ] 50 VUs  0m50.9s/1m0s

running (0m52.0s), 50/50 VUs, 1471 complete and 0 interrupted iterations
download   [  86% ] 50 VUs  0m51.8s/1m0s

running (0m53.0s), 50/50 VUs, 1491 complete and 0 interrupted iterations
download   [  88% ] 50 VUs  0m52.9s/1m0s

running (0m54.0s), 50/50 VUs, 1503 complete and 0 interrupted iterations
download   [  90% ] 50 VUs  0m53.9s/1m0s

running (0m55.0s), 50/50 VUs, 1535 complete and 0 interrupted iterations
download   [  91% ] 50 VUs  0m54.9s/1m0s

running (0m56.0s), 50/50 VUs, 1559 complete and 0 interrupted iterations
download   [  93% ] 50 VUs  0m55.9s/1m0s

running (0m57.0s), 50/50 VUs, 1581 complete and 0 interrupted iterations
download   [  95% ] 50 VUs  0m56.9s/1m0s

running (0m58.0s), 50/50 VUs, 1608 complete and 0 interrupted iterations
download   [  96% ] 50 VUs  0m57.8s/1m0s

running (0m59.0s), 50/50 VUs, 1638 complete and 0 interrupted iterations
download   [  98% ] 50 VUs  0m58.9s/1m0s

running (1m00.0s), 50/50 VUs, 1686 complete and 0 interrupted iterations
download   [ 100% ] 50 VUs  0m59.9s/1m0s

running (1m01.0s), 26/50 VUs, 1715 complete and 0 interrupted iterations
download ↓ [ 100% ] 50 VUs  1m0s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.01' rate=0.34%

    t_download
    ✓ 'p(95)<3000' p(95)=1.59s


  █ TOTAL RESULTS 

    checks_total.......: 3480   56.751444/s
    checks_succeeded...: 99.65% 3468 out of 3480
    checks_failed......: 0.34%  12 out of 3480

    ✗ download 200
      ↳  99% — ✓ 1734 / ✗ 6
    ✗ nhận đủ file
      ↳  99% — ✓ 1734 / ✗ 6

    CUSTOM
    download_bytes.................: 1503269660 24515150.485629/s
    t_download.....................: avg=827.92ms min=151.29ms med=754.45ms p(50)=754.45ms p(95)=1.59s p(99)=2.17s max=3.17s

    HTTP
    http_req_duration..............: avg=827.52ms min=126.89ms med=754.12ms p(50)=754.12ms p(95)=1.59s p(99)=2.17s max=3.17s
      { expected_response:true }...: avg=827.83ms min=126.89ms med=754.12ms p(50)=754.12ms p(95)=1.59s p(99)=2.17s max=3.17s
    http_req_failed................: 0.34%      6 out of 1741
    http_reqs......................: 1741       28.39203/s

    EXECUTION
    iteration_duration.............: avg=1.74s    min=162.12ms med=1.65s    p(50)=1.65s    p(95)=2.78s p(99)=3.41s max=4.56s
    iterations.....................: 1740       28.375722/s
    vus............................: 26         min=26            max=50
    vus_max........................: 50         min=50            max=50

    NETWORK
    data_received..................: 1.6 GB     26 MB/s
    data_sent......................: 675 kB     11 kB/s



running (1m01.3s), 00/50 VUs, 1740 complete and 0 interrupted iterations
download ✓ [ 100% ] 50 VUs  1m0s